#!/usr/bin/env python
# -*- coding: utf-8 -*-

def init_game():
    # Гравці розставляють кораблі.
    # Визначається, хто ходить першим.
    pass


def game_loop():
    # 2) Очікування вводу від поточного гравця (коорд-ти пострілу)
    # Перевірка: Чи не стріляли сюди раніше?

    # 3) Обробка рез-ту:
    # Промах: Хід переходить до иншого гравця
    # Влучання: Гравець отримує право на ще один постріл
    # Корабель потоплено: Перевірка, чи це був останній корабель

    # 4) Перевірка умови перемоги: Якщо у суперника 0 живих клітинок - цикл перерив-ся
    
    # 5) Кінець циклу: Повернення до п.2
    pass


def main():
    pass


if __name__ == '__main__':
    main()